package cn.m1c.gczj.common;
/**
 * 正则表达式常量
 */
public class RegEx {
	public final static  String MOBILE_REGEX = "^[1][3578]\\d{9}$";
	
	public final static  String NUM_REGEX = "^\\d+$";
	
	/**
	 * Ip正则表达式
	 */
	public static String IP_REGEX = new String("^(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9])\\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])$");
	
}
